; https://sicp.readthedocs.io/en/latest/chp3/43.html

; 假如交换过程是按顺序运行的，那么交换 10 、 20 和 30 有以下可能的并发运行序列（ e 代表 exchange ）：
; 运行序列                      ; 相应的决策树表示
; (e 10 20) => (e 10 30)               (e 10 20)
;                                       /     \
; (e 10 20) => (e 20 30)               /       \
;                                 (e 10 30) (e 20 30)
;
;
; (e 10 30) => (e 10 20)               (e 10 30)
;                                       /     \
; (e 10 30) => (e 20 30)               /       \
;                                 (e 10 20) (e 20 30)
;
;
; (e 20 30) => (e 10 20)               (e 20 30)
;                                       /     \
; (e 20 30) => (e 10 30)               /       \
;                                 (e 10 20) (e 10 30)


; 如果使用未串行化的 exchange 实现账户余额交换，那么三个帐号之间的余额就可能不再是 10 、 20 和 30 的某个排列。
;  |      acc-1                                    acc-2                                         acc-3
;  |       |                                         |                                             |
;  |       |                                         |                                             |
;  |       +-----------------------------------------+                                             |
;  |       |      exchange                                                                         |
;  |       |          |                                                                            |
;  |       |          v                                                                            |
;  |       |      acc-1 balance: 10                                                                |
;  |       |          |                                                                            |
;  |       |          v                                                                            |
;  |       |      acc-2 balance: 20                                                                |
;  |       |          |                                                                            |
;  |       |          |                                                                            |
;  |       |          |                                                                            |
;  |       |          |                                                                            |
;  |       +---------------------------------------------------------------------------------------+
;  |                  |                                           exchange
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           acc-1 balance: 10
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           acc-3 balance: 30
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           difference: (- 10 30) = -20
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           ((acc-1 'withdraw) -20)
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           acc-1 balance: 10 + 20 = 30
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           ((acc-3 'deposit) -20)
;  |                  |                                               |
;  |                  |                                               v
;  |                  |                                           acc-3 balance: 30 - 20 = 10
;  |                  |
;  |                  v
;  |              difference: (- 10 20) = -10
;  |                  |
;  |                  v
;  |              ((acc-1 'withdraw) -10)
;  |                  |
;  |                  v
;  |              acc-1 balance: 10 + 10 = 20
;  |                  |
;  |                  v
;  |              ((acc-2 'deposit) -10)
;  |                  |
;  |                  v
;  |              acc-2 balance: 20 - 10 = 10
;  |
;  v
; time
